Repository: vopl/Whitepaper
Catalog: latex/omegat-ru/omegat-ru-level2.tmx
Source language: en_us
Languages: ru

source: PPIO's well-designed incentives provide attractive financial rewards to miners and encourage them to contribute to the network.
ru: Грамотно спроектированные поощрения в PPIO предоставляют привлекательные винансовые вознаграждения майнерам и провоцируют их на взаимодействие с сетью.

source: PoW introduces wasteful computation and energy consumption, and it does not take into account the different levels of storage and bandwidth contribution among the miners, which are crucial to a decentralized distributed storage system.
ru: PoW предполагает производство массивных вычислений, тем самым форсирует потребление большого количества энергии, а так же, он не учитывает объемы хранилищ и мощность каналов связи майнеров, являющихся ключевыми аспектами в децентрализованной распределенной системе хранения данных.

source: Proof of Download (PoD) ensures that user can download the stored data correctly.
ru: Доказательство получения (Proof of Download, PoD) убеждает пользователя в том что он может корректно получить хранимые майнером данные.

source: Proof of Replication (PoRep) is used to guarantee that the miners replicate user's data.
ru: Доказательство пересылки (Proof of Replication, PoRep) гарантирует то что майнет реплицировал пользовательские данные.

source: Section 3 of this chapter explains PPIO's Proof of Replication (PoRep), Proof of Download (PoD), Proof of Spacetime (PoSt), and Light Proof of Capacity (LPoC) that are designed to defend the network against all these attacks and maintain the integrity of the system.
ru: Секция 3 данной главы раскрывает такие механизмы доказывания в PPIO как Доказательство пересылки (Proof of Replication, PoRep), Доказательство получения данных (Proof of Download, PoD), Доказательство хранения данных в течении времени (Proof of Spacetime, PoSt) и Облегченное доказательство вместимости (Light Proof of Capacity, LPoC), спроектированные для защиты сети против всех этих атак и поддержания целостности системы.

source: Siacoin is one of the attempts that is built on top of Bitcoin-like Proof of Work (PoW) consensus.
ru: Одна из таких попыток, Seacoin, построенная на основе Бикоин-подобного консенсуса Proof of Work (PoW).

source: So it is what PPIO attempts to accomplish.
ru: Вот чего пытается достигнуть PPIO.

source: Some of the known issues of Storj are the lack of quick response from miners upon storage request and its transactions are settled once per month which is not friendly to the miners.
ru: Некоторые из известных проблем Storj - это невозможность получения быстрого ответа от майнеров относительно запросов на хранение, а так же их транзакций, фиксируемых раз в месяц, что не является удобным для майнеров.

source: Storj is another project that has gone through years of development, but it remains in the testing phase.
ru: Storj, другой проект, разрабатываемый вот уже в течении нескольких лет, но так и не вышедший из фазы тестирования.

source: Subsequent segments and pieces from the current point of playback need to be prioritized in download scheduling, to maintain smooth streaming playback.
ru: Для гладкого проигрывания потока, планировщик скачивания должен приоритезировать последующие сегменты и части от текущей точки воспроизведения.

source: Such deficiency in the design can lead to many real-world problems to the miners and ISPs.
ru: Такие ущербности в заимствованной архитектуре могут приводить ко множеству проблем в реальном использовании, как для майнеров так и для поставщиков интернета (Internet Service Providers, ISPs).

source: Such experiences allow the team to develop efficient and practical solutions to achieve the following design goals.
ru: Такой опыт позволяет команде разрабатывать эффективное и практичное решение, направленное на следующие цели.

source: The data breach has become frequently occurred, with an ever-growing scale and impact.
ru: Порча и утеря данных происходят все чаще, с постоянно растущим масштабом и влиянием.

source: The download requests of the remaining pieces will be re-routed to other peers.
ru: Запросы на скачивание оставшихся частей будут переадресованы другим пирам.

source: The estimated arrival time for each piece can be calculated based on the speed of each virtual connection and the remaining pieces to be downloaded in each queue.
ru: Оценочное время доставки каждой части может быть вычеслено на основе информации о скорости каждого виртуального соединения и уже имеющихся частей к загрузке в каждой очереди.

source: The global cloud storage market has grown enormously in recent years and will continue to grow at a faster pace.
ru: Глобальный рынок облачных хранилищ в значительной мере вырос за последние годы и продолжает расти быстрыми темпами .

source: The optimized and secure implementation of the proofs allows them to function efficiently at large scale, that enables the incentive system to operate in securely and help establish a healthy decentralized distributed storage market and economic system.
ru: Оптимизированная и безопасная реализация доказательств позволяет им эффективно функционировать на больших масштабах, что дает возможность безопасно функционировать системе поощрений, помогая устанавливать здоровую среду для рынка и экономической системы распределенных хранилищ.

source: The pieces at the anchor point are prioritized during download, to improve the user experience.
ru: Для улучшения восприятия пользователем, во время скачивания приоритезируются части в опорных точках.

source: The scheduler is also designed to maximize download speed and minimize the overhead of duplicated requests and data transmission.
ru: Так же, планировщик спроектирован для максимизации скорости загрузки и минимизации накладных расходов вследствие дублирования запросов и передачи данных.

source: The technology has gone through many iterations of trial-and-error optimizations and is proven to provide high-quality user experience to streaming applications such as video-on-demand (VOD) service.
ru: Технология прошла сквозь множество итераций проб и ошибок и доказала способность предоставления пользователю высоко-качественной поддержки потоковых приложений, таких как службы видео-по-запросу (video-on-demand, VOD).

source: The unpopular pieces (especially in media streaming) need to be prioritized during download.
ru: Непопулярные части (особенно при вещании медиа) нуждаются в приоритезации во время скачивания.

source: These incidents pose a grave threat to not just the privacy of individual users, but also the security and integrity of the entire Internet.
ru: Такие инциденты представляют серьезную угрозу не только приватности отдельных пользователей, но, так же, безопасности и целостности всего Интернета.

source: This allows PPIO to make use of the vast amount of unused bandwidth and storage resources on the Internet, and provide robust storage service at much lower cost.
ru: Это позволяет PPIO задействовать большое количество неиспользуемой полосы пропускания каналов связи и ресурсов хранилищ в сети Интернет, предоставить мощную услугу хранения данных по сильно менщей цене.

source: This may seem counterintuitive, but prioritizing these pieces will help make downloading of the entire segment much faster and get a better experience.
ru: Это может выглядеть контринтуитивно, но, приоритезация таких частей помогает более быстрому скачиванию всего сегмента оставляет у пользователя лучшие впечатления.

source: This process is called {\bf Multi-point Download Scheduling}.
ru: Данный процесс называется {\bf Планированием скачивания из многих источников (Multi-point Download Scheduling)}.

source: To achieve the design requirements above, a scheduling algorithm is required to make smart decisions on which peer a piece should be downloaded from, how many peers should be used for simultaneous download, how to set up the timer for each peer, how to reschedule remaining pieces and adapt to network changes, etc.
ru: Для удовлетворения представленных выше требований дизайна, алгоритм планирования должен принимать взвешенные решения, от какого пира должна быть получена часть, как много пиров использовать для одновременной загрузки, как управлять таймером для каждого пира, как перепланировать оставшиеся части и адаптироваться к изменениям сети и т.п.

source: To make the storage system easy to use, PPIO introduces a scheme called "Coin Pool", that helps the users to store and download micropayments.
ru: Для облегчения использования системы хранения, PPIO предлагает схему, называемую "Coin Pool", помогающую пользователям выгружать и загружать микроплатежи.

source: UDP based protocols such as KCP or UDT\cite{article13} are attempted first to make the connection.
ru: Сначала предпринимается попытка соединения по протоколам, основанным на UDP, таким как KCP или UDT\cite{article13}.

source: \\ \\ In this work, PPIO's design goals are explained, followed by the details on how it achieves these goals.
ru: \\ \\ В данном документе разъясняются основные цели архитектуры PPIO, а так же, приводятся подробности методов достижения этих целей.

source: \\ \\A P2P streaming system has the following unique design characteristics:
ru: \\ \\Одноранговая система потокового вещания обладает следующими уникальными характеристиками дизайна:

source: \\ \\Besides to supporting efficient file download, PPIO also supports optimized P2P data streaming.
ru: \\ \\Наряду с поддержкой эффективного скачивания файлов, PPIO так же поддерживает оптимизированное одноранговое потоковое вещание данных.

source: \\ \\From the discussions above, it is clear that a more complete decentralized distributed storage solution is yet to be built to support large-scale and real-world storage system.
ru: \\ \\Из изложенного выше становится понятно, что готовая децентрализованная распределенная система хранения, способная поддерживать высокое масштабирование и задачи реального мира, еще не построена.

source: \\ \\The emerging FileCoin project that is under development by Protocol Labs adds an incentive layer on top of Inter-planetary File System (IPFS), with the goal to build a storage infrastructure and protocol to replace HTTP protocol.
ru: \\ \\Новый проект FileCoin, разрабатываемый Protocol Labs, добавляет слой поощрений над Inter-planetary File System (IPFS), с целью построения инфраструктуры хранилищ и протокола для замены HTTP.

source: \\ \\There have been many attempts to build distributed storage systems.
ru: \\ \\Предпринималось не мало попыток построения распределенных систем хранения данных.

source: \\ \\Two data-driven scheduling algorithms are developed for Multi-point Download Scheduling:
ru: \\ \\В рамках Multi-point Download Scheduling разработано два алгоритма планирования:

source: \\\\Summary of the PPIO scheduling algorithm:
ru: \\\\Алгоритм планирования PPIO в кратце:

source: \author {\centerline{\Large Abstract}}
ru: \author {\centerline{\Large Аннотация}}

source: \centerline{{Figure 2.1 Illustration of pre-allocation}}
ru: \centerline{{Рисунок 2.1 Иллюстрация предварительного распределения}}

source: \section{Introduction} %—1
ru: \section{Введение} %—1

source: \section{Solution} %——2
ru: \section{Решение} %——2

source: \subsection{P2P Network} %——2.2 \cite{article4}\cite{article5}\cite{article6}\cite{article7}
ru: \subsection{Одноранговая сеть (P2P Network)} %——2.2 \cite{article4}\cite{article5}\cite{article6}\cite{article7}

source: \subsection{Technology Highlights} %——2.1
ru: \subsection{Основные технологии} %——2.1

source: \subsubsection{Data Driven Scheduling} %——2.2.
ru: \subsubsection{Планирование на основе данных (Data Driven Scheduling)} %——2.2.

# itle{ LARGEbf PPIO: A Programmable P2P Storage and\Delivery Network} %———标题
source: \title{ \LARGE\bf PPIO: A Programmable P2P Storage and\\Delivery Network} %———标题
ru: \title{ \LARGE\bf PPIO: Программируемая одноранговая сеть\\хранения и доставки} %———标题

source: \usepackage{hyperref}%——————————————————————目录超链接
ru: \usepackage[unicode]{hyperref}%——————————————————————目录超链接

source: \usepackage{pxfonts}
ru: %\usepackage{pxfonts} \usepackage{libertine} \usepackage{libertinust1math} \usepackage[T2A,T1]{fontenc} \usepackage[utf8]{inputenc} \usepackage[english,russian]{babel}

source: •\quad {\bf Low Storage Cost.} In the future, high storage cost is one of the critical challenges for many companies.
ru: •\quad {\bf Малая цена хранения.} В будущем, высокая цена хранения данных будет одним из критичных вызовов для многих компаний.

source: •\quad 1/10 the operation cost of the traditional data network;
ru: •\quad Операционные расходы составляют 1/10 по сравнению с традиционными сетями;

source: •\quad 400PB storage combined P2P storage capacity;
ru: •\quad Суммарная вместимость хранилищ одноранговых узлов составляет 400PB;

source: •\quad File Download
ru: •\quad Получение файлов (File Download)

source: •\quad Media streaming on demand\cite{article4}
ru: •\quad Потоковое вещание по заказу (Media streaming on demand)\cite{article4}

source: •\quad Sequential download.
ru: •\quad Последовательное скачивание (Sequential download).

source: •\quad The anchor point.
ru: •\quad Опорная точка (The anchor point).

source: •\quad The world‘s only P2P data storage and transmission network that operates on more than 500 million nodes;
ru: •\quad Единственная в мире одноранговая сеть хранения и передачи, функционирующая на более чем 500 миллионах узлах;

source: •\quad Unpopular pieces.
ru: •\quad Непопулярные части (Unpopular pieces).

source: •\quad {\bf P2P Network:} PPIO constructs a self-governing, resilient and scalable P2P network that allows the participating nodes to easily share idle or unused bandwidth, storage, and computation resources.
ru: •\quad {\bf Одноранговая сеть (P2P Network):} PPIO формирует самоорганизующуюся устойчивую и масштабируемую одноранговую (P2P) сеть, позволяющую участвующим в ней узлам легко совместно использовать простаивующую или не-используемую пропускную способность каналов связи, ресурсы хранилищ и вычислительные мощности.

source: •\quad {\bf Consensus: } Popular blockchain consensus algorithms such as Proof of Work (PoW), Proof of Stake (PoS) and Delegated Proof of Stake (DPoS) all make trade-offs in decentralization, security and performance.
ru: •\quad {\bf Консенсус (Consensus): } Популярные алгоритмы консенсусов над блокчейнами, такие как Proof of Work (PoW), Proof of Stake (PoS) и Delegated Proof of Stake (DPoS) представляют собой компромисы между децентрализацией, безопасностью и быстродействием.

source: •\quad {\bf Privacy, Security and Stability.} Data security and privacy protection are the top requirements in PPIO's distributed file system design.
ru: •\quad {\bf Приватность, безопасность и стабильность.} Безопасность и приватность данных являются ключевыми требованиями в дизайне распределенной файловой системе PPIO.

source: •\quad {\bf Proof:} The nodes of the traditional P2P network are free to choose join or leave the network, it is difficult to maintain the stability of the network.
ru: •\quad {\bf Доказательство (Proof):} Узлы традиционной P2P сети свободно присоединяются к сети и свободно покидают ее, в таких условиях сложно поддерживать стабильность сети.

source: •\quad {\bf Scalability and High Efficiency.} Benefit from the founding team's experience from creating and operating the distributed network with hundreds of millions of users, PPIO is designed from the ground up to perform efficiently at a global scale.
ru: •\quad {\bf Масштабируемость и высокая эффективность.} За счет опыта команды, извлеченного из создания и работы с распределенной сетью с тысячами миллионов пользователей, PPIO спроектирована с нуля до состояния, в котором она может быть эффективной в глобальном масштабе.

source: •\quad {\bf Strong Application Support and Ecosystem.} PPIO provides a set of storage APIs similar to those of the cloud services such as AWS S3 and makes the data migration from those services much comfortable.
ru: •\quad {\bf Надежная поддержка приложений и экосистема.} PPIO предоставляет несколько программных интерфейсов хранилищ (Storage APIs), похожих на таковые в облачных сервисах, например AWS S3, и позволяет комфортно мигрироать данные из этих сервисов.
